# Joins using pandas

## Introduction

This Jupyter notebook explores SQL joins using Python.

## Left outer join

In [1]:
import pandas as pd
import numpy as np

In [2]:
department_data = {
    'DepartmentID': [31, 33, 34, 35],
    'DepartmentName': ['Sales', 'Engineering', 'Clerical', 'Marketing']
}
df_department = pd.DataFrame(department_data,
                             columns=['DepartmentID',
                                      'DepartmentName'])
df_department

   DepartmentID DepartmentName
0            31          Sales
1            33    Engineering
2            34       Clerical
3            35      Marketing

In [3]:
df_department.dtypes

DepartmentID       int64
DepartmentName    object
dtype: object

In [4]:
employee_data = {
    'LastName': ['Rafferty', 'Jones', 'Heisenberg', 'Robinson', 'Smith', 'Williams'],
    'DepartmentID': [31, 33, 33, 34, 34, np.nan]
}
df_employee = pd.DataFrame(employee_data,
                           columns=['LastName',
                                    'DepartmentID'])
df_employee['DepartmentID'] = df_employee['DepartmentID'].round().astype('Int64')
df_employee

     LastName  DepartmentID
0    Rafferty            31
1       Jones            33
2  Heisenberg            33
3    Robinson            34
4       Smith            34
5    Williams           NaN

In [5]:
df_employee.dtypes

LastName        object
DepartmentID     Int64
dtype: object

## Previous example deprecated

In [6]:
left_table = pd.read_csv('left_table.csv')

In [7]:
left_table.head()

        ID             Employee           Equipment  Qty
0  64566.0           Debra Aten  Laptop 12" SC1 SH2    1
1      NaN                  NaN     Monitor 22" SC1    1
2  67059.0       Marcia Paulsen  Laptop 12" SC1 SH2    1
3      NaN                  NaN     Monitor 22" SC1    2
4  67127.0  Stephen Krumpack Jr  Laptop 12" SC1 SH2    1

In [8]:
left_table.shape

(638, 4)

In [9]:
left_table.insert(loc=2, column='Desk Location', value='')

In [10]:
left_table.head()

        ID             Employee Desk Location           Equipment  Qty
0  64566.0           Debra Aten                Laptop 12" SC1 SH2    1
1      NaN                  NaN                   Monitor 22" SC1    1
2  67059.0       Marcia Paulsen                Laptop 12" SC1 SH2    1
3      NaN                  NaN                   Monitor 22" SC1    2
4  67127.0  Stephen Krumpack Jr                Laptop 12" SC1 SH2    1

In [11]:
left_table.dtypes

ID               float64
Employee          object
Desk Location     object
Equipment         object
Qty                int64
dtype: object

In [12]:
left_table.head()

        ID             Employee Desk Location           Equipment  Qty
0  64566.0           Debra Aten                Laptop 12" SC1 SH2    1
1      NaN                  NaN                   Monitor 22" SC1    1
2  67059.0       Marcia Paulsen                Laptop 12" SC1 SH2    1
3      NaN                  NaN                   Monitor 22" SC1    2
4  67127.0  Stephen Krumpack Jr                Laptop 12" SC1 SH2    1

In [13]:
right_table = pd.read_csv('right_table.csv')

In [14]:
right_table.head()

                Names Desk Location      Laptop       Monitors
0  Christian Herrmann        30-001           1         1 24in
1     Matthias Ruegge        30-003           1         1 24in
2       Harrison Dobe        30-004  1 Macbook   1 Mac Monitor
3        Ross Duchene        30-005           1              2
4        Denise Lauer        30-006           1         1 24in

In [15]:
right_table.dtypes

Names            object
Desk Location    object
Laptop           object
Monitors         object
dtype: object

In [16]:
left_table['Desk Location'] = left_table[['Employee']]\
    .merge(right_table[['Names', 'Desk Location']],\
                         left_on='Employee', \
                         right_on='Names', \
                         how='left')['Desk Location'].values

In [17]:
left_table.shape

(638, 5)

In [18]:
left_table.head(10)

        ID                 Employee Desk Location           Equipment  Qty
0  64566.0               Debra Aten           NaN  Laptop 12" SC1 SH2    1
1      NaN                      NaN           NaN     Monitor 22" SC1    1
2  67059.0           Marcia Paulsen        30-014  Laptop 12" SC1 SH2    1
3      NaN                      NaN           NaN     Monitor 22" SC1    2
4  67127.0      Stephen Krumpack Jr           NaN  Laptop 12" SC1 SH2    1
5  67128.0         Kimberly Tentler           NaN  Laptop 12" SC1 SH2    1
6  67131.0  Kelly Klein-Bartkiewicz        30-110  Laptop 14" SC1 SH2    1
7      NaN                      NaN           NaN     Monitor 22" SC1    2
8  67132.0            Robert Stella           NaN  Laptop 14" SC1 SH2    1
9      NaN                      NaN           NaN  Laptop 12" SC1 SH2    1

In [19]:
# Find employees not assigned a 'Desk Location'.
# Their name was misspelled or not entered in table_right.
left_table = left_table[['ID', \
                         'Employee', \
                         'Desk Location']]\
                       [left_table['Desk Location'].isnull()]

In [20]:
left_table.head(10)

         ID             Employee Desk Location
0   64566.0           Debra Aten           NaN
1       NaN                  NaN           NaN
3       NaN                  NaN           NaN
4   67127.0  Stephen Krumpack Jr           NaN
5   67128.0     Kimberly Tentler           NaN
7       NaN                  NaN           NaN
8   67132.0        Robert Stella           NaN
9       NaN                  NaN           NaN
10      NaN                  NaN           NaN
11  67164.0           Winnie Kuo           NaN

In [21]:
left_table = left_table.dropna(subset=['Employee'])

In [22]:
left_table['ID'] = left_table['ID'].astype(int)

In [23]:
left_table.head()

       ID             Employee Desk Location
0   64566           Debra Aten           NaN
4   67127  Stephen Krumpack Jr           NaN
5   67128     Kimberly Tentler           NaN
8   67132        Robert Stella           NaN
11  67164           Winnie Kuo           NaN

In [24]:
left_table.to_csv('left_table_exceptions.csv')

In [25]:
# descriptive statistics
left_table['ID'].count()

223